--select * from Fingrag_csv 



UPDATE Fingrag_csv SET [Дата_процедуры] = case when year([Дата_процедуры]) = 1899 then null else [Дата_процедуры] end
											,[Вид_процедуры] = case when len([Вид_процедуры]) = 0 or [Вид_процедуры] = N'-' then null else [Вид_процедуры] end
											,[Полное_наименование] = case when len([Полное_наименование]) = 0 or [Полное_наименование] = N'-' then null else [Полное_наименование] end
											,[Сокращенное_наименование] = case when len([Сокращенное_наименование]) = 0 or [Сокращенное_наименование] = N'-' then null else [Сокращенное_наименование] end
											,[Индекс] = case when len([Индекс]) = 0 or [Индекс] = N'-' then null else REPLACE(REPLACE([Индекс], N',', N'.'), CHAR(32), '') end
											,[Субъект_федерации] = case when len([Субъект_федерации]) = 0 or [Субъект_федерации] = N'-' then null else [Субъект_федерации] end
											,[Населенный_пункт] = case when len([Населенный_пункт]) = 0 or [Населенный_пункт] = N'-' then null else [Населенный_пункт] end
											,[Улица_дом] = case when len([Улица_дом]) = 0 or [Улица_дом] = N'-' then null else [Улица_дом] end
											,[Статус_подразделения] = case when len([Статус_подразделения]) = 0 or [Статус_подразделения] = N'-' then null else [Статус_подразделения] end
											,[Дата_отркытия_офиса] = case when year([Дата_отркытия_офиса]) = 1899 then null else [Дата_отркытия_офиса] end
											,[Дата_ закрытия_офиса] = case when year([Дата_ закрытия_офиса]) = 1899 then null else [Дата_ закрытия_офиса] end
											,[Арендованное_помещение] = case when len([Арендованное_помещение]) = 0 or [Арендованное_помещение] = N'-' then null else [Арендованное_помещение] end
											,[Площадь_подразделения] = case when len([Площадь_подразделения]) = 0 then '0' else REPLACE([Площадь_подразделения], N',', N'.') end	--числовые поля
											,[Реквизиты_договора] = case when len([Реквизиты_договора]) = 0 or [Реквизиты_договора] = N'-' then null else [Реквизиты_договора] end
											,[Сумма_ежемесячного_платежа] = case when len([Сумма_ежемесячного_платежа]) = 0 then '0' else REPLACE([Сумма_ежемесячного_платежа], N',', N'.') end	--числовые поля
											,[Код_СВКредит] = case when len([Код_СВКредит]) = 0 or [Код_СВКредит] = N'-' then null else [Код_СВКредит] end
											,[Код_РБС] = case when len([Код_РБС]) = 0 or [Код_РБС] = N'-' then null else [Код_РБС] end
											,[Код_Инверсия] = case when len([Код_Инверсия]) = 0 or [Код_Инверсия] = N'-' then null else [Код_Инверсия] end
											,[Код_ХД] = case when len([Код_ХД]) = 0 or [Код_ХД] = N'-' then null else [Код_ХД] end
											,[Код_1С] = case when len([Код_1С]) = 0 or [Код_1С] = N'-' then null else [Код_1С] end
											,[Тип_подразделения] = case when len([Тип_подразделения]) = 0 or [Тип_подразделения] = N'-' then null else [Тип_подразделения] end
											,[Контрагент] = case when len([Контрагент]) = 0 or [Контрагент] = N'-' then null else [Контрагент] end
											,[Наименование_в_СВК_ХД] = case when len([Наименование_в_СВК_ХД]) = 0 or [Наименование_в_СВК_ХД] = N'-' then null else [Наименование_в_СВК_ХД] end
											,[РП_привязка] = case when len([РП_привязка]) = 0 or [РП_привязка] = N'-' then null else [РП_привязка] end
											,[Блокировка] = case when len([Блокировка]) = 0 or [Блокировка] = N'-' then null else [Блокировка] end
											,[Прежний_код_подразделения] = case when len([Прежний_код_подразделения]) = 0 or [Прежний_код_подразделения] = N'-' then null else [Прежний_код_подразделения] end
											,[Front_Back1] = case when len([Front_Back1]) = 0 or [Front_Back1] = N'-' then null else [Front_Back1] end
											,[Идентификация_сетевого_магазина] = case when len([Идентификация_сетевого_магазина]) = 0 or [Идентификация_сетевого_магазина] = N'-' then null else [Идентификация_сетевого_магазина] end
											,[Бизнес_группа] = case when len([Бизнес_группа]) = 0 or [Бизнес_группа] = N'-' then null else [Бизнес_группа] end
											,[Адрес_УС_если_не_совпадает_с_адресом_офиса] = case when len([Адрес_УС_если_не_совпадает_с_адресом_офиса]) = 0 or [Адрес_УС_если_не_совпадает_с_адресом_офиса] = N'-' then null else [Адрес_УС_если_не_совпадает_с_адресом_офиса] end
											,[Долгосрочная_аренда] = case when len([Долгосрочная_аренда]) = 0 or [Долгосрочная_аренда] = N'-' then null else [Долгосрочная_аренда] end
											,[Руководитель_РП] = case when len([Руководитель_РП]) = 0 or [Руководитель_РП] = N'-' then null else [Руководитель_РП] end
											,[Приказы] = case when len([Приказы]) = 0 or [Приказы] = N'-' then null else [Приказы] end
											,[Номер_телефона] = case when len([Номер_телефона]) = 0 or [Номер_телефона] = N'-' then null else [Номер_телефона] end
											,[Режим_работы_офиса_доступа_к_УС] = case when len([Режим_работы_офиса_доступа_к_УС]) = 0 or [Режим_работы_офиса_доступа_к_УС] = N'-' then null else [Режим_работы_офиса_доступа_к_УС] end
											,[Инкассирующее_подразделение_кэшина] = case when len([Инкассирующее_подразделение_кэшина]) = 0 or [Инкассирующее_подразделение_кэшина] = N'-' then null else [Инкассирующее_подразделение_кэшина] end
											,[Инкассирующее_подразделение_банкомата] = case when len([Инкассирующее_подразделение_банкомата]) = 0 or [Инкассирующее_подразделение_банкомата] = N'-' then null else [Инкассирующее_подразделение_банкомата] end
											,[Дата_запуска_кэшина_первая] = case when year([Дата_запуска_кэшина_первая]) = 1899 then null else [Дата_запуска_кэшина_первая] end
											,[Кол_во_запущенных_банкоматов_с_функцией_кэшин] = case when len([Кол_во_запущенных_банкоматов_с_функцией_кэшин]) = 0 then '0' else REPLACE([Кол_во_запущенных_банкоматов_с_функцией_кэшин], N',', N'.') end
											,[Операции] = case when len([Операции]) = 0 or [Операции] = N'-' then null else [Операции] end
											,[Обслуживание_ЮЛ] = case when len([Обслуживание_ЮЛ]) = 0 or [Обслуживание_ЮЛ] = N'-' then null else [Обслуживание_ЮЛ] end
											,[Наличие_кассы] = case when len([Наличие_кассы]) = 0 or [Наличие_кассы] = N'-' then null else [Наличие_кассы] end
											,[Ориентиры_станция_метро] = case when len([Ориентиры_станция_метро]) = 0 or [Ориентиры_станция_метро] = N'-' then null else [Ориентиры_станция_метро] end
											,[Примечание] = case when len([Примечание]) = 0 or [Примечание] = N'-' then null else [Примечание] end
											,[Код_Террасофт] = case when len([Код_Террасофт]) = 0 or [Код_Террасофт] = N'-' then null else [Код_Террасофт] end
											,[Дата_запуска_банкомата_первая] = case when year([Дата_запуска_банкомата_первая]) = 1899 then null else [Дата_запуска_банкомата_первая] end
											,[ID_Дирекции] = case when len([ID_Дирекции]) = 0 or [ID_Дирекции] = N'-' then null else [ID_Дирекции] end
											,[Дни_работы_точки] = case when len([Дни_работы_точки]) = 0 or [Дни_работы_точки] = N'-' then null else [Дни_работы_точки] end
											,[Дата_начала_простоя_точки] = case when year([Дата_начала_простоя_точки]) = 1899 then null else [Дата_начала_простоя_точки] end
											,[Дата_возобновления_работы_точки] = case when year([Дата_возобновления_работы_точки]) = 1899 then null else [Дата_возобновления_работы_точки] end
											,[J_шники_устройств] = case when len([J_шники_устройств]) = 0 or [J_шники_устройств] = N'-' then null else [J_шники_устройств] end
											,[Ответственный_за_кассовый_лимит] = case when len([Ответственный_за_кассовый_лимит]) = 0 or [Ответственный_за_кассовый_лимит] = N'-' then null else [Ответственный_за_кассовый_лимит] end
											,[Код_ФЕС] = case when len([Код_ФЕС]) = 0 or [Код_ФЕС] = N'-' then null else [Код_ФЕС] end
											,[СКБ_GE] = case when len([СКБ_GE]) = 0 or [СКБ_GE] = N'-' then null else [СКБ_GE] end
											,[Ориентиры_остановка_транспорта] = case when len([Ориентиры_остановка_транспорта]) = 0 or [Ориентиры_остановка_транспорта] = N'-' then null else [Ориентиры_остановка_транспорта] end
											,[Ориентиры_значимые_объекты] = case when len([Ориентиры_значимые_объекты]) = 0 or [Ориентиры_значимые_объекты] = N'-' then null else [Ориентиры_значимые_объекты] end
											,[Ориентиры_торговые_центры] = case when len([Ориентиры_торговые_центры]) = 0 or [Ориентиры_торговые_центры] = N'-' then null else [Ориентиры_торговые_центры] end
											,[Ориентиры_район_города] = case when len([Ориентиры_район_города]) = 0 or [Ориентиры_район_города] = N'-' then null else [Ориентиры_район_города] end
											,[Причины_внесения_в_справочник] = case when len([Причины_внесения_в_справочник]) = 0 or [Причины_внесения_в_справочник] = N'-' then null else [Причины_внесения_в_справочник] end
											,[Арендованные_УС] = case when len([Арендованные_УС]) = 0 or [Арендованные_УС] = N'-' then null else [Арендованные_УС] end
											,[Блокировка2] = case when len([Блокировка2]) = 0 or [Блокировка2] = N'-' then null else [Блокировка2] end
											,[Дирекция_РП_привязка] = case when len([Дирекция_РП_привязка]) = 0 or [Дирекция_РП_привязка] = N'-' then null else [Дирекция_РП_привязка] end
											,[Код_РП_в_Финград_РП_Привязка] = case when len([Код_РП_в_Финград_РП_Привязка]) = 0 or [Код_РП_в_Финград_РП_Привязка] = N'-' then null else [Код_РП_в_Финград_РП_Привязка] end
											,[ID_Бизнес_группа_Бизнес_группа] = case when len([ID_Бизнес_группа_Бизнес_группа]) = 0 or [ID_Бизнес_группа_Бизнес_группа] = N'-' then null else [ID_Бизнес_группа_Бизнес_группа] end
											,[ID_Дирекции_Дирекция] = case when len([ID_Дирекции_Дирекция]) = 0 or [ID_Дирекции_Дирекция] = N'-' then null else [ID_Дирекции_Дирекция] end
											,[Управление_Дирекции_Бизнес_группа] = case when len([Управление_Дирекции_Бизнес_группа]) = 0 or [Управление_Дирекции_Бизнес_группа] = N'-' then null else [Управление_Дирекции_Бизнес_группа] end
											,[ID_Управления_Дирекции_Управление_Дирекции] = case when len([ID_Управления_Дирекции_Управление_Дирекции]) = 0 or [ID_Управления_Дирекции_Управление_Дирекции] = N'-' then null else [ID_Управления_Дирекции_Управление_Дирекции] end
											,[ОКАТО] = case when len([ОКАТО]) = 0 or [ОКАТО] = N'-' then null else [ОКАТО] end
											,[ОКТМО] = case when len([ОКТМО]) = 0 or [ОКТМО] = N'-' then null else [ОКТМО] end


UPDATE Fingrag_csv SET [Индекс] = REPLACE([Индекс], char(160), '')
UPDATE Fingrag_csv SET [Индекс] = SUBSTRING([Индекс], 1, isnull(charindex('.', [Индекс]), 1) - 1) --WHERE [Код_подразделения] = '04-07-24-011'
UPDATE Fingrag_csv SET [Индекс] = SUBSTRING([Индекс], 1, 6) 
UPDATE Fingrag_csv SET Кол_во_запущенных_банкоматов_с_функцией_кэшин = null where Кол_во_запущенных_банкоматов_с_функцией_кэшин = '06.08.2014'

UPDATE Fingrag_csv SET [Дни_работы_точки] = '1111110' WHERE [Дни_работы_точки] = '111110'