UPDATE Fingrad_csv SET [Кол_во_запущенных_кэшинов] = REPLACE([Кол_во_запущенных_кэшинов], N',', N'.'), 
											 [Кол_во_запущенных_банкоматов_всего] = REPLACE([Кол_во_запущенных_банкоматов_всего], N',', N'.'), 
											 [Кол_во_запущенных_банкоматов_с_функцией_кэшин] = REPLACE([Кол_во_запущенных_банкоматов_с_функцией_кэшин], N',', N'.'), 
											 [Кол_во_запущенных_банкоматов_с_функцией_ресайклинг] = REPLACE([Кол_во_запущенных_банкоматов_с_функцией_ресайклинг], N',', N'.'),
											 [Сумма_ежемесячного_платежа] = REPLACE([Сумма_ежемесячного_платежа], N',', N'.'),
											 [Площадь_подразделения] = REPLACE([Площадь_подразделения], N',', N'.') 


UPDATE Fingrad_csv SET [Кол_во_запущенных_кэшинов] = case when len([Кол_во_запущенных_кэшинов]) = 0 then N'0' else [Кол_во_запущенных_кэшинов] end,
											 [Кол_во_запущенных_банкоматов_всего] = case when len([Кол_во_запущенных_банкоматов_всего]) = 0 then N'0' else [Кол_во_запущенных_банкоматов_всего] end, 
											 [Кол_во_запущенных_банкоматов_с_функцией_кэшин] = case when len([Кол_во_запущенных_банкоматов_с_функцией_кэшин]) = 0 then N'0' else [Кол_во_запущенных_банкоматов_с_функцией_кэшин] end, 
											 [Кол_во_запущенных_банкоматов_с_функцией_ресайклинг] = case when len([Кол_во_запущенных_банкоматов_с_функцией_ресайклинг]) = 0 then N'0' else [Кол_во_запущенных_банкоматов_с_функцией_ресайклинг] end,
											 [Сумма_ежемесячного_платежа] = case when len([Сумма_ежемесячного_платежа]) = 0 then N'0' else [Сумма_ежемесячного_платежа] end, 
											 [Площадь_подразделения] = case when len([Площадь_подразделения]) = 0 then N'0' else [Площадь_подразделения] end

UPDATE Fingrad_csv SET [Сокращенное_наименование] = case when len([Сокращенное_наименование]) = 0 or [Сокращенное_наименование] = N'-' then null else [Сокращенное_наименование] end
											,[Индекс] = case when len([Индекс]) = 0 or [Индекс] = N'-' then null else REPLACE(REPLACE([Индекс], N',', N'.'), CHAR(32), '') end
											,[Субъект_федерации] = case when len([Субъект_федерации]) = 0 or [Субъект_федерации] = N'-' then null else [Субъект_федерации] end
											,[Населенный_пункт] = case when len([Населенный_пункт]) = 0 or [Населенный_пункт] = N'-' then null else [Населенный_пункт] end
											,[Улица_дом] = case when len([Улица_дом]) = 0 or [Улица_дом] = N'-' then null else [Улица_дом] end
											,[Дата_открытия_офиса] = case when year([Дата_открытия_офиса]) = 1900 then null else [Дата_открытия_офиса] end
											,[Дата_закрытия_офиса] = case when year([Дата_закрытия_офиса]) = 1900 then null else [Дата_закрытия_офиса] end
											,[Арендованное_помещение] = case when len([Арендованное_помещение]) = 0 or [Арендованное_помещение] = N'-' then null else [Арендованное_помещение] end
											,[Код_СВКредит] = case when len([Код_СВКредит]) = 0 or [Код_СВКредит] = N'-' then null else [Код_СВКредит] end
											,[Код_РБС] = case when len([Код_РБС]) = 0 or [Код_РБС] = N'-' then null else [Код_РБС] end
											,[Тип_подразделения] = case when len([Тип_подразделения]) = 0 or [Тип_подразделения] = N'-' then null else [Тип_подразделения] end
											,[РП_привязка] = case when len([РП_привязка]) = 0 or [РП_привязка] = N'-' then null else [РП_привязка] end
											,[Блокировка] = case when len([Блокировка]) = 0 or [Блокировка] = N'-' then null else [Блокировка] end
											,[Прежний_код_подразделения] = case when len([Прежний_код_подразделения]) = 0 or [Прежний_код_подразделения] = N'-' then null else [Прежний_код_подразделения] end
											,[Front_Back1] = case when len([Front_Back1]) = 0 or [Front_Back1] = N'-' then null else [Front_Back1] end
											,[Идентификация_сетевого_магазина] = case when len([Идентификация_сетевого_магазина]) = 0 or [Идентификация_сетевого_магазина] = N'-' then null else [Идентификация_сетевого_магазина] end
											,[Бизнес_группа] = case when len([Бизнес_группа]) = 0 or [Бизнес_группа] = N'-' then null else [Бизнес_группа] end
											,[Руководитель_РП] = case when len([Руководитель_РП]) = 0 or [Руководитель_РП] = N'-' then null else [Руководитель_РП] end
											,[Приказы] = case when len([Приказы]) = 0 or [Приказы] = N'-' then null else [Приказы] end
											,[№_телефона] = case when len([№_телефона]) = 0 or [№_телефона] = N'-' then null else [№_телефона] end
											,[Режим_работы_офиса_доступа_к_УС] = case when len([Режим_работы_офиса_доступа_к_УС]) = 0 or [Режим_работы_офиса_доступа_к_УС] = N'-' then null else [Режим_работы_офиса_доступа_к_УС] end
											,[Инкассирующее_подразделение_кэшина] = case when len([Инкассирующее_подразделение_кэшина]) = 0 or [Инкассирующее_подразделение_кэшина] = N'-' then null else [Инкассирующее_подразделение_кэшина] end
											,[Инкассирующее_подразделение_банкомата] = case when len([Инкассирующее_подразделение_банкомата]) = 0 or [Инкассирующее_подразделение_банкомата] = N'-' then null else [Инкассирующее_подразделение_банкомата] end
											,[Дата_запуска_кэшина_первая] = case when year([Дата_запуска_кэшина_первая]) = 1900 then null else [Дата_запуска_кэшина_первая] end
											,[Кол_во_запущенных_банкоматов_с_функцией_кэшин] = case when len([Кол_во_запущенных_банкоматов_с_функцией_кэшин]) = 0 then '0' else REPLACE([Кол_во_запущенных_банкоматов_с_функцией_кэшин], N',', N'.') end
											,[Операции] = case when len([Операции]) = 0 or [Операции] = N'-' then null else [Операции] end
											,[Обслуживание_ЮЛ] = case when len([Обслуживание_ЮЛ]) = 0 or [Обслуживание_ЮЛ] = N'-' then null else [Обслуживание_ЮЛ] end
											,[Наличие_кассы] = case when len([Наличие_кассы]) = 0 or [Наличие_кассы] = N'-' then null else [Наличие_кассы] end
											,[Дата_запуска_банкомата_первая] = case when year([Дата_запуска_банкомата_первая]) = 1900 then null else [Дата_запуска_банкомата_первая] end
											,[ID_Дирекции] = case when len([ID_Дирекции]) = 0 or [ID_Дирекции] = N'-' then null else [ID_Дирекции] end
											,[Дни_работы_точки] = case when len([Дни_работы_точки]) = 0 or [Дни_работы_точки] = N'-' then null else [Дни_работы_точки] end
											,[Дата_начала_простоя_точки] = case when year([Дата_начала_простоя_точки]) = 1900 then null else [Дата_начала_простоя_точки] end
											,[Дата_возобновления_работы_точки] = case when year([Дата_возобновления_работы_точки]) = 1900 then null else [Дата_возобновления_работы_точки] end
											,[СКБ_GE] = case when len([СКБ_GE]) = 0 or [СКБ_GE] = N'-' then null else [СКБ_GE] end
											,[Ориентиры_станция_метро] = case when len([Ориентиры_станция_метро]) = 0 or [Ориентиры_станция_метро] = N'-' then null else [Ориентиры_станция_метро] end
											,[Ориентиры_остановка_транспорта] = case when len([Ориентиры_остановка_транспорта]) = 0 or [Ориентиры_остановка_транспорта] = N'-' then null else [Ориентиры_остановка_транспорта] end
											,[Ориентиры_значимые_объекты] = case when len([Ориентиры_значимые_объекты]) = 0 or [Ориентиры_значимые_объекты] = N'-' then null else [Ориентиры_значимые_объекты] end
											,[Ориентиры_торговые_центры] = case when len([Ориентиры_торговые_центры]) = 0 or [Ориентиры_торговые_центры] = N'-' then null else [Ориентиры_торговые_центры] end
											,[Ориентиры_район_города] = case when len([Ориентиры_район_города]) = 0 or [Ориентиры_район_города] = N'-' then null else [Ориентиры_район_города] end
											,[Причины_внесения_в_справочник] = case when len([Причины_внесения_в_справочник]) = 0 or [Причины_внесения_в_справочник] = N'-' then null else [Причины_внесения_в_справочник] end
											,[ID_Управления_Дирекции_Управление_Дирекции] = case when len([ID_Управления_Дирекции_Управление_Дирекции]) = 0 or [ID_Управления_Дирекции_Управление_Дирекции] = N'-' then null else [ID_Управления_Дирекции_Управление_Дирекции] end
