----60312810101910317200 Центральное агентство воздушных сообщений ООО (ИНН 5610076190)
----60312810101910406700 Айрапетян А.В. ИП
----60312810201910317100 Международное транспортное агенство "Билет" ООО
----60312810201910721000 Авто-42 ООО
----60312810301905018000 Сиат АВИА ООО
----60312810301909736100 Система-Экспресс ООО
----60312810301910706200 ЦАВС ОАО
----60312810301910829200 МБС-тур Туристическое агентсво ООО
----60312810301913851000 Хабаровсктурист ЗАО
----60312810301913930400 Западно-Сибирское агенство воздушных сообщения ООО
----60312810401905102900 Приморское агенство авиационных компаний ОАО
----60312810401913169100 Сервис-центр Челябинск ООО
----60312810601904772500 НИКО ТУР в г.Краснодаре филиал ЗАО
----60312810701914147300 Центральное агентство воздушных сообщений ООО (ИНН 3666074603)
----60312810801913488300 Авиафлот Барнаул ООО
----60312810801914054500 Моисей ООО
----60312810901311780500 МУШ Фирма ООО
----60312810901904775100 Джуваликян Армине Симоновна ИП
----60312810901913693600 Полет-Сервис АВС ООО
----60312810901913912200 Животов Владимир Викторович ИП
----60312810301909163100 АВИА ЦЕНТР Агенство

--60312810901913829500	101 Отель ООО
--60312810701910152700	Абакан Гостиница  ООО
--60312810601909193100	Аврора ООО
insert into dbo.Contractor (Account,Name) values (N'60312810101910317200',N'Центральное агентство воздушных сообщений ООО (ИНН 5610076190)')
insert into dbo.Contractor (Account,Name) values (N'60312810101910406700',N'Айрапетян А.В. ИП')
insert into dbo.Contractor (Account,Name) values (N'60312810201910317100',N'Международное транспортное агенство "Билет" ООО')

insert into dbo.Contractor (Account,Name) values (N'60312810901913829500',N'101 Отель ООО')
insert into dbo.Contractor (Account,Name) values (N'60312810701910152700',N'Абакан Гостиница  ООО')
insert into dbo.Contractor (Account,Name) values (N'60312810601909193100',N'Аврора ООО')